Autodesk.Navisworks.Api.MeasurementType
The type of measurement tool being used.

Autodesk.Navisworks.Api.MeasurementType.None
No measurement type

Autodesk.Navisworks.Api.MeasurementType.Distance
Distance measurement type

Autodesk.Navisworks.Api.MeasurementType.Angle
Angle measurement type

Autodesk.Navisworks.Api.MeasurementType.Area
Area measurement type